app/views/admin/items/new.html.erb

      <div class="col-md-10">
    　　<%= f.collection_select :genre_id, Genre.all, :id, :name,{prompt: "選択してください"} %>
---
SELECT "genres".* FROM "genres"