app/controllers/admin/homes_controller.rb

SELECT "admins".* FROM "admins"
---
  def top
    @admins = Admin.all