app/controllers/admin/items_controller.rb

INSERT INTO "items" ("name", "introduction", "price", "is_active", "image_id", "genre_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
 def create
   @item = Item.new(item_params)
   @item.save