app/controllers/public/addresses_controller.rb

  def create
   @address = Address.new(address_params)
   @address.save
---
INSERT INTO "addresses" ("created_at", "updated_at", "name", "postal_code", "address") VALUES (?, ?, ?, ?, ?)  [["created_at", "2022-04-06 10:34:11.890912"], ["updated_at", "2022-04-06 10:34:11.890912"], ["name", "sato"], ["postal_code", "5555555"], ["address", "神奈川県"]]

  def update
   address = Address.find(params[:id])
---
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]