app/controllers/public/cart_items_controller.rb

INSERT INTO "cart_items" ("created_at", "updated_at", "amount", "item_id", "customer_id") VALUES (?, ?, ?, ?, ?)  [["created_at", "2022-04-12 09:29:16.187845"], ["updated_at", "2022-04-12 09:29:16.187845"], ["amount", 1], ["item_id", 1], ["customer_id", 1]]
---
  def create
   @cart_item = CartItem.new(cart_item_params)
   @cart_item.customer_id = current_customer.id

   @cart_item.save

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 2]]
---
  def destroy
   cart_item = CartItem.find(params[:id])
   cart_item.destroy

DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 1]]
---
  def destroy_all
   CartItem.destroy_all

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = ? LIMIT ?  [["id", 25], ["LIMIT", 1]]
UPDATE "cart_items" SET "amount" = ?, "updated_at" = ? WHERE "cart_items"."id" = ?  [["amount", 3], ["updated_at", "2022-04-13 11:43:37.831720"], ["id", 25]]
---
  def update
    @cart_item = CartItem.find(params[:id])
    @cart_item.update(cart_item_params)