app/controllers/public/orders_controller.rb

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
  def confirm
    @order = Order.new(order_params)
    @address = Address.find(params[:order][:address_id])