app/controllers/public/orders_controller.rb

  def create
   @order = Order.new(order_params)
   @order.customer_id = current_customer.id
   @order.save
   current_customer.cart_items.destroy_all
---
INSERT INTO "orders" ("created_at", "updated_at", "customer_id", "postal_code", "address", "name", "postage", "invoice") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 21]]

  def confirm
    @order = Order.new(order_params)
    @address = Address.find(params[:order][:address_id])
    @order.postal_code = @address.postal_code
    @order.address = @address.address
    @order.name = @address.name
    @cart_items = CartItem.where(customer_id: current_customer.id)
---
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."customer_id" = ?  [["customer_id", 1]]