app/views/public/orders/new.html.erb

   <div>
    <%= f.select :address_id, options_from_collection_for_select(Address.all, :id, :full_address) %>
---
SELECT "addresses".* FROM "addresses"